#include <iostream>
#include <string>

using namespace std;

// دالة لتوليد وطباعة الكلمات من AAA إلى ZZZ
void PrintAllFromAAAtoZZZ()
{
    cout << "\n"; // طباعة سطر فارغ لتنسيق المخرجات
    string word = ""; // متغير نصي فارغ لتجميع حروف الكلمة الثلاثية

    // الحلقة الخارجية: للحرف الأول
    for (int i = 65; i <= 90; i++)
    {
        // الحلقة الوسطى: للحرف الثاني
        for (int j = 65; j <= 90; j++)
        {
            // الحلقة الداخلية: للحرف الثالث
            for (int k = 65; k <= 90; k++)
            {
                // إضافة الحرف الأول للمتغير النصي
                word.append(1, char(i));
                // إضافة الحرف الثاني للمتغير النصي
                word.append(1, char(j));
                // إضافة الحرف الثالث للمتغير النصي
                word.append(1, char(k));

                // طباعة الكلمة الكاملة التي تم تجميعها
                cout << word << endl;
                
                // تفريغ المتغير النصي تماماً للاستعداد للكلمة التالية
                word = "";
            }
        }
         cout << "\n____________________________\n";
    }
}

int main()
{
    // استدعاء الدالة لتنفيذ عملية الطباعة
    PrintAllFromAAAtoZZZ();

    return 0;
}
